---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.DirectContext3DFailures
source: html/8fa89df8-8e56-92ca-0a1d-5590bf151357.htm
---
# BuiltInFailures.DirectContext3DFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.